/*
Navicat MySQL Data Transfer

Source Server         : mysql
Source Server Version : 50551
Source Host           : localhost:3306
Source Database       : portdata

Target Server Type    : MYSQL
Target Server Version : 50551
File Encoding         : 65001

Date: 2024-01-27 10:49:55
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for t_port
-- ----------------------------
DROP TABLE IF EXISTS `t_port`;
CREATE TABLE `t_port` (
  `t_id` int(255) NOT NULL,
  `t_name` varchar(255) NOT NULL COMMENT '港口名称',
  `t_type` int(255) NOT NULL COMMENT '港口类型（0{港口},1{停泊区}）',
  `t_localtion` varchar(255) NOT NULL COMMENT '港口所在区域（内陆、渤海、黄海、东海、南海）',
  `t_amount` int(255) NOT NULL COMMENT '港口流量',
  `t_balance` int(255) NOT NULL COMMENT '港口流量差值',
  `t_citygdp` double(255,2) NOT NULL COMMENT '港口所在城市的GDP值  ',
  `t_grow` double(255,10) NOT NULL COMMENT '港口所在城市的人口增长率 ',
  PRIMARY KEY (`t_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- ----------------------------
-- Records of t_port
-- ----------------------------
INSERT INTO `t_port` VALUES ('1', '上海', '0', '东海', '3002', '250', '44652.80', '0.0804437680');
INSERT INTO `t_port` VALUES ('2', '南通', '0', '东海', '2460', '114', '11379.60', '0.0773979220');
INSERT INTO `t_port` VALUES ('3', '长江口', '1', '东海', '713', '27', '14850.82', '0.0773979220');
INSERT INTO `t_port` VALUES ('4', '南京', '0', '东海', '1727', '393', '16907.85', '0.0773979220');
INSERT INTO `t_port` VALUES ('5', '江阴', '0', '东海', '2146', '-6', '14850.82', '0.0773979220');
INSERT INTO `t_port` VALUES ('6', '张家港', '0', '东海', '1261', '-45', '24000.00', '0.0773979220');
INSERT INTO `t_port` VALUES ('7', '舟山', '0', '东海', '1630', '48', '1951.30', '0.1863177710');
INSERT INTO `t_port` VALUES ('8', '扬州', '0', '东海', '1440', '132', '7104.98', '0.0773979220');
INSERT INTO `t_port` VALUES ('9', '天津', '0', '渤海', '837', '19', '16737.30', '0.0717088370');
INSERT INTO `t_port` VALUES ('10', '锦州', '1', '渤海', '484', '100', '1201.70', '-0.0264002990');
INSERT INTO `t_port` VALUES ('11', '岚山', '0', '黄海', '1113', '169', '2306.77', '0.0598622460');
INSERT INTO `t_port` VALUES ('12', '靖江', '0', '东海', '1522', '164', '6401.77', '0.0773979220');
INSERT INTO `t_port` VALUES ('13', '泉州', '0', '东海', '333', '-75', '12102.97', '0.1259240740');
INSERT INTO `t_port` VALUES ('14', '广州', '0', '内陆', '530', '62', '30355.73', '0.2081373550');
INSERT INTO `t_port` VALUES ('15', '黄骅', '1', '渤海', '743', '55', '756.20', '0.0383559060');
INSERT INTO `t_port` VALUES ('16', '坊城', '0', '内陆', '595', '77', '12698.39', '0.2081373550');
INSERT INTO `t_port` VALUES ('17', '湛江', '0', '内陆', '128', '38', '3712.56', '0.2081373550');
INSERT INTO `t_port` VALUES ('18', '宁波', '0', '东海', '1056', '96', '15704.30', '0.1863177710');
INSERT INTO `t_port` VALUES ('19', '厦门', '0', '东海', '326', '2', '7802.66', '0.1259240740');
INSERT INTO `t_port` VALUES ('20', '曹妃甸', '0', '渤海', '662', '-16', '9133.30', '0.0383559060');
INSERT INTO `t_port` VALUES ('21', '连云港', '0', '黄海', '271', '103', '4005.03', '0.0773979220');
INSERT INTO `t_port` VALUES ('22', '石岛', '0', '黄海', '749', '51', '3408.18', '0.0598622460');
INSERT INTO `t_port` VALUES ('23', '青岛', '0', '黄海', '414', '10', '14920.75', '0.0598622460');
INSERT INTO `t_port` VALUES ('24', '常州', '0', '东海', '722', '84', '9550.10', '0.0773979220');
INSERT INTO `t_port` VALUES ('25', '新会', '0', '内陆', '227', '81', '3373.41', '0.2081373550');
INSERT INTO `t_port` VALUES ('26', '闵行', '0', '东海', '453', '59', '44652.80', '0.0804437680');
INSERT INTO `t_port` VALUES ('27', '镇江', '0', '东海', '1878', '26', '5017.00', '0.0773979220');
INSERT INTO `t_port` VALUES ('28', '台州', '0', '东海', '137', '47', '6040.72', '0.1863177710');
INSERT INTO `t_port` VALUES ('29', '太仓', '0', '东海', '997', '5', '24000.00', '0.0773979220');
INSERT INTO `t_port` VALUES ('30', '莱州', '1', '渤海', '178', '28', '9515.86', '0.0598622460');
INSERT INTO `t_port` VALUES ('31', '天津', '1', '渤海', '734', '82', '16737.30', '0.0717088370');
INSERT INTO `t_port` VALUES ('32', '平潭', '0', '东海', '65', '3', '12308.32', '0.1259240740');
INSERT INTO `t_port` VALUES ('33', '烟台', '0', '渤海', '648', '2', '9515.86', '0.0598622460');
INSERT INTO `t_port` VALUES ('34', '中山', '0', '内陆', '327', '35', '3631.28', '0.2081373550');
INSERT INTO `t_port` VALUES ('35', '大连', '0', '黄海', '405', '11', '8752.90', '-0.0264002990');
INSERT INTO `t_port` VALUES ('36', '日照', '0', '黄海', '616', '24', '2306.77', '0.0598622460');
INSERT INTO `t_port` VALUES ('37', '钦州', '0', '内陆', '208', '-12', '1917.00', '0.0890834520');
INSERT INTO `t_port` VALUES ('38', '秦皇岛', '0', '渤海', '393', '-25', '1909.52', '0.0383559060');
INSERT INTO `t_port` VALUES ('39', '龙口', '0', '渤海', '925', '61', '9515.86', '0.0598622460');
INSERT INTO `t_port` VALUES ('40', '宁波', '1', '东海', '368', '48', '15704.30', '0.1863177710');
INSERT INTO `t_port` VALUES ('41', '黄花', '0', '渤海', '209', '19', '756.20', '0.0383559060');
INSERT INTO `t_port` VALUES ('42', '东莞', '0', '内陆', '186', '18', '11200.32', '0.2081373550');
INSERT INTO `t_port` VALUES ('43', '南通', '1', '东海', '420', '-8', '11379.60', '0.0773979220');
INSERT INTO `t_port` VALUES ('44', '温州', '1', '东海', '203', '7', '8730.60', '0.1863177710');
INSERT INTO `t_port` VALUES ('45', '惠州', '0', '内陆', '158', '14', '5639.68', '0.2081373550');
INSERT INTO `t_port` VALUES ('46', '马迹山', '0', '东海', '424', '30', '14850.82', '0.1863177710');
INSERT INTO `t_port` VALUES ('47', '洋浦', '0', '内陆', '151', '1', '260.00', '0.1625683070');
INSERT INTO `t_port` VALUES ('48', '乍浦', '0', '东海', '285', '-1', '6739.45', '0.1863177710');
INSERT INTO `t_port` VALUES ('49', '南山', '0', '内陆', '561', '1', '32387.68', '0.2081373550');
INSERT INTO `t_port` VALUES ('50', '涪陵', '0', '内陆', '60', '30', '30145.79', '0.1112102230');
INSERT INTO `t_port` VALUES ('51', '常熟', '0', '东海', '578', '14', '24000.00', '0.0773979220');
INSERT INTO `t_port` VALUES ('52', '高港', '0', '东海', '241', '-5', '6401.77', '0.0773979220');
INSERT INTO `t_port` VALUES ('53', '宁德', '1', '东海', '230', '10', '3554.62', '0.1259240740');
INSERT INTO `t_port` VALUES ('54', '威海', '0', '黄海', '313', '45', '3408.18', '0.0598622460');
INSERT INTO `t_port` VALUES ('55', '京唐', '1', '渤海', '199', '7', '9133.30', '0.0383559060');
INSERT INTO `t_port` VALUES ('56', '六横', '0', '东海', '616', '-8', '1951.30', '0.1863177710');
INSERT INTO `t_port` VALUES ('57', '铜陵', '0', '内陆', '117', '31', '1209.90', '0.0256577760');
INSERT INTO `t_port` VALUES ('58', '湄洲岛', '0', '东海', '461', '51', '3116.25', '0.1259240740');
INSERT INTO `t_port` VALUES ('59', '南沙', '1', '内陆', '457', '-11', '30355.73', '0.2081373550');
INSERT INTO `t_port` VALUES ('60', '岚山', '1', '黄海', '609', '9', '2306.77', '0.0598622460');
INSERT INTO `t_port` VALUES ('61', '连云港', '1', '黄海', '218', '-14', '4005.03', '0.0773979220');
INSERT INTO `t_port` VALUES ('62', '漳州', '0', '东海', '164', '4', '5706.58', '0.1259240740');
INSERT INTO `t_port` VALUES ('63', '黄埔', '0', '内陆', '400', '14', '30355.73', '0.2081373550');
INSERT INTO `t_port` VALUES ('64', '江阴', '1', '东海', '230', '-14', '14850.82', '0.0773979220');
INSERT INTO `t_port` VALUES ('65', '太仓', '1', '东海', '271', '1', '24000.00', '0.0773979220');
INSERT INTO `t_port` VALUES ('66', '秦皇岛', '1', '渤海', '229', '13', '1909.52', '0.0383559060');
INSERT INTO `t_port` VALUES ('67', '北海', '0', '内陆', '115', '19', '1674.21', '0.0890834520');
INSERT INTO `t_port` VALUES ('68', '日照', '1', '黄海', '658', '-6', '2306.77', '0.0598622460');
INSERT INTO `t_port` VALUES ('69', '泉州', '1', '东海', '213', '-3', '12102.97', '0.1259240740');
INSERT INTO `t_port` VALUES ('70', '重庆', '0', '内陆', '56', '6', '30145.79', '0.1112102230');
INSERT INTO `t_port` VALUES ('71', '黄埔', '1', '内陆', '187', '-3', '30355.73', '0.2081373550');
INSERT INTO `t_port` VALUES ('72', '珠江(改为珠海）', '1', '内陆', '387', '1', '4045.45', '0.2081373550');
INSERT INTO `t_port` VALUES ('73', '温州', '0', '东海', '95', '-13', '8730.60', '0.1863177710');
INSERT INTO `t_port` VALUES ('74', '虎门', '0', '内陆', '204', '0', '11200.32', '0.2081373550');
INSERT INTO `t_port` VALUES ('75', '舟山', '1', '东海', '297', '-3', '1951.30', '0.1863177710');
INSERT INTO `t_port` VALUES ('76', '龙海', '0', '东海', '39', '-29', '5706.58', '0.1259240740');
INSERT INTO `t_port` VALUES ('77', '锦州', '0', '渤海', '307', '-79', '1201.70', '-0.0264002990');
INSERT INTO `t_port` VALUES ('78', '潍坊', '0', '渤海', '75', '1', '7306.45', '0.0598622460');
INSERT INTO `t_port` VALUES ('79', '仪征', '0', '东海', '183', '29', '7104.98', '0.0773979220');
INSERT INTO `t_port` VALUES ('80', '珠海', '0', '内陆', '212', '4', '4045.45', '0.2081373550');
INSERT INTO `t_port` VALUES ('81', '曹妃甸', '1', '渤海', '253', '1', '9133.30', '0.0383559060');
INSERT INTO `t_port` VALUES ('82', '烟台', '1', '渤海', '530', '2', '9515.86', '0.0598622460');
INSERT INTO `t_port` VALUES ('83', '鲅鱼圈', '0', '渤海', '207', '-33', '1431.60', '-0.0264002990');
INSERT INTO `t_port` VALUES ('84', '新沙', '0', '内陆', '136', '4', '11200.32', '0.0598622460');
INSERT INTO `t_port` VALUES ('85', '蛇口', '0', '内陆', '315', '-3', '32387.68', '0.2081373550');
INSERT INTO `t_port` VALUES ('86', '洪湾', '0', '内陆', '78', '16', '4045.45', '0.0598622460');
INSERT INTO `t_port` VALUES ('87', '大连', '1', '黄海', '246', '0', '8752.90', '-0.0264002990');
INSERT INTO `t_port` VALUES ('88', '鲅鱼圈', '1', '渤海', '169', '47', '1431.60', '-0.0264002990');
INSERT INTO `t_port` VALUES ('89', '衢山', '0', '东海', '241', '-1', '1951.30', '0.1863177710');
INSERT INTO `t_port` VALUES ('90', '东营', '0', '渤海', '156', '10', '3620.74', '0.0598622460');
INSERT INTO `t_port` VALUES ('91', '罗源', '0', '东海', '65', '5', '12308.32', '0.1259240740');
INSERT INTO `t_port` VALUES ('92', '陈家港', '0', '黄海', '52', '-6', '7079.80', '0.0773979220');
INSERT INTO `t_port` VALUES ('93', '三亚', '0', '内陆', '5', '5', '847.11', '0.1625683070');
INSERT INTO `t_port` VALUES ('94', '三山', '0', '东海', '89', '-7', '4402.60', '0.0598622460');
INSERT INTO `t_port` VALUES ('95', '松门', '0', '东海', '56', '8', '6040.72', '0.1863177710');
INSERT INTO `t_port` VALUES ('96', '京唐', '0', '渤海', '118', '4', '9133.30', '0.0383559060');
INSERT INTO `t_port` VALUES ('97', '厦门', '1', '东海', '136', '18', '7802.66', '0.1259240740');
INSERT INTO `t_port` VALUES ('98', '董家口', '0', '黄海', '194', '6', '14920.75', '0.0598622460');
INSERT INTO `t_port` VALUES ('99', '惠州', '1', '内陆', '117', '-3', '5639.68', '0.2081373550');
INSERT INTO `t_port` VALUES ('100', '积米崖', '0', '黄海', '328', '-4', '14920.75', '0.0598622460');
INSERT INTO `t_port` VALUES ('101', '坊城', '1', '内陆', '230', '10', '12698.39', '0.2081373550');
INSERT INTO `t_port` VALUES ('102', '秀屿', '0', '东海', '36', '4', '3116.25', '0.1259240740');
INSERT INTO `t_port` VALUES ('103', '泰兴', '0', '东海', '75', '17', '1366.67', '0.0773979220');
INSERT INTO `t_port` VALUES ('104', '宁德', '0', '东海', '70', '2', '3554.62', '0.1259240740');
INSERT INTO `t_port` VALUES ('105', '深圳', '0', '内陆', '364', '32', '32387.68', '0.0598622460');
INSERT INTO `t_port` VALUES ('106', '金塘', '0', '东海', '81', '11', '1951.30', '0.1863177710');
INSERT INTO `t_port` VALUES ('107', '莱州', '0', '渤海', '310', '10', '9515.86', '0.0598622460');
INSERT INTO `t_port` VALUES ('108', '常熟', '1', '东海', '308', '0', '24000.00', '0.0773979220');
INSERT INTO `t_port` VALUES ('109', '青岛', '1', '黄海', '211', '-29', '14920.75', '0.0598622460');
INSERT INTO `t_port` VALUES ('110', '黄阁', '0', '内陆', '84', '0', '30355.73', '0.2081373550');
INSERT INTO `t_port` VALUES ('111', '启东', '0', '东海', '31', '7', '11379.60', '0.0773979220');
INSERT INTO `t_port` VALUES ('112', '长兴岛', '0', '渤海', '58', '0', '44652.80', '0.1863177710');
INSERT INTO `t_port` VALUES ('113', '湛江', '1', '内陆', '48', '-6', '3712.56', '0.2081373550');
INSERT INTO `t_port` VALUES ('114', '象山', '0', '东海', '39', '7', '15704.30', '0.1863177710');
INSERT INTO `t_port` VALUES ('115', '丽江', '0', '内陆', '82', '20', '620.10', '0.0270424130');
INSERT INTO `t_port` VALUES ('116', '海口', '0', '内陆', '72', '16', '2134.77', '0.1625683070');
INSERT INTO `t_port` VALUES ('117', '赤鱲角', '0', '内陆', '227', '1', '24280.00', '0.0374752390');
INSERT INTO `t_port` VALUES ('118', '旅顺', '0', '渤海', '179', '9', '8752.90', '-0.0264002990');
INSERT INTO `t_port` VALUES ('119', '廉江', '0', '东海', '62', '-12', '3712.56', '0.2081373550');
INSERT INTO `t_port` VALUES ('120', '滨州', '0', '渤海', '86', '-2', '2975.15', '0.0598622460');
INSERT INTO `t_port` VALUES ('121', '福州', '0', '东海', '41', '5', '12308.32', '0.1259240740');
INSERT INTO `t_port` VALUES ('122', '蓬莱', '0', '渤海', '124', '-2', '9515.86', '0.0598622460');
